In [1]:
import pandas as pd

In [5]:
def count_top3(years):
        
    df_res = pd.DataFrame()
    for year in years:
        path = f'names\yob{year}.txt'
        df = pd.read_csv(path, names = ['name', 'gender', 'quantity'])
        # df['year'] = year
        df_res = pd.concat([df_res, df])
    
    df_group = df_res.groupby(['name']).sum()
    df_sort = df_group.sort_values('quantity', ascending = False, inplace = False).head(3)
    
    # Пыталась оставить один столбец с именами, но почему-то так не работает
    # result = df_sort['name']
    # return result
           
    return df_sort

In [4]:
count_top3([1900, 1950, 2000])

        quantity
name
James     111789
John      109601
Robert    101368

In [6]:
count_top3([1880])

         quantity
name
John         9701
William      9562
Mary         7092

In [3]:
def count_dynamics(years):
        
    df_res = pd.DataFrame()
    for year in years:
        path = f'names\yob{year}.txt'
        df = pd.read_csv(path, names = ['name', 'gender', 'quantity'])
        df['year'] = year
        df_res = pd.concat([df_res, df])
    
    df_group = df_res.groupby(['year','gender']).sum()
        
     
    return df_group
    
count_dynamics([1900, 1950, 2000])

             quantity
year gender
1900 F         299798
     M         150480
1950 F        1713065
     M        1790437
2000 F        1815295
     M        1963202